In [1]:
# Pandas
import pandas as pd

# SQL Alchemy
from sqlalchemy import create_engine
import psycopg2

In [2]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:ENTERPASSWORD@localhost:5432/Employees')
#ENTERPASSWORD
conn = engine.connect()

In [3]:
salaries=pd.read_sql('''
    SELECT 
        e.emp_no as "employee number"
        , last_name as "Last Name"
        , first_name as "First Name"
        , sex
        , s.salary
    FROM employees e
    LEFT JOIN salaries s on s.emp_no=e.emp_no
    ''', conn)

In [4]:
salaries.head()
salaries.dtypes

employee number     int64
Last Name          object
First Name         object
sex                object
salary              int64
dtype: object

In [5]:
bins = [0, 49999, 70000, 90000, 110000, 130000,150000]
grp_names=["Up to 50k","50k-69.9K","70K-89.9k","90k-109.9k","110K-129.9K","Over 130K"]

In [6]:
salaries["ranges"] = pd.cut(salaries["salary"], bins, labels=grp_names, include_lowest=True)
salaries

        employee number     Last Name First Name sex  salary     ranges
0                 57444          Babb      Berry   F   48973  Up to 50k
1                 13616         Lorho      Perry   F   40000  Up to 50k
2                240129        Karnin      Roddy   M   43548  Up to 50k
3                427958        Poujol   Feixiong   F   63377  50k-69.9K
4                 35916        Talmon     Wonhee   F   40000  Up to 50k
...                 ...           ...        ...  ..     ...        ...
300019           222402      Klyachko      Jaana   F   40000  Up to 50k
300020            70921  Bernardeschi    Martijn   F   40000  Up to 50k
300021           275129          Perz        Fay   M   59703  50k-69.9K
300022           202478      Michaels   Xiaoheng   M   48038  Up to 50k
300023            81057     Pocchiola   Patricio   M   40000  Up to 50k

[300024 rows x 6 columns]

In [7]:
x_axis=salaries['ranges']
x_axis

0         Up to 50k
1         Up to 50k
2         Up to 50k
3         50k-69.9K
4         Up to 50k
            ...
300019    Up to 50k
300020    Up to 50k
300021    50k-69.9K
300022    Up to 50k
300023    Up to 50k
Name: ranges, Length: 300024, dtype: category
Categories (6, object): ['Up to 50k' < '50k-69.9K' < '70K-89.9k' < '90k-109.9k' < '110K-129.9K' < 'Over 130K']